Methods to deal with missing data in pandas
Missing data is represented in pandas with NaN values
Methods such as drop or fill helps in dropping or filling missing values

In [2]:
import numpy as np
import pandas as pd

In [3]:
### create a new list called "labels"  with strings
labels = ['a','b','c','d','e']

#### create a new list of numbers
my_data = [10,20,30,40,50]

#### create a numpy array 
arr = np.array(my_data)

### create a dictionary
d = {'key1':10, 'key2':20,'key3':100,'key4':40,'key5':50}

### create list labindex 
labindex = ['lbidx1','lbidx2','lbidx3','lbidx4','lbindx5' ]
print(labindex)

['lbidx1', 'lbidx2', 'lbidx3', 'lbidx4', 'lbindx5']

In [10]:
### create a series using dictionary d

mseries = pd.Series(data=d,index=labels)
print(mseries)
### observe the missing values represented as "NaN"
### d is dictionary. already has keys. we are trying to ovreride it with our own index labels
### since there is no matching index and since keys in dictionaries are immutable, we gte NaN or Not a Number or Missing Values

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

In [11]:
### correct way of creating a series with dictionary
mseries1 = pd.Series(data=d)
print(mseries1)

key1     10
key2     20
key3    100
key4     40
key5     50
dtype: int64

In [12]:
mseries

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

In [14]:
### to drop missing values
mseries_dropna = mseries.dropna()

In [17]:
mseries

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

In [18]:
mseries_dropna

Series([], dtype: float64)

In [19]:
mseries_dropna = mseries.dropna(inplace=True)

In [22]:
print(mseries)

Series([], dtype: float64)

In [8]:
mseries

Series([], dtype: float64)

In [25]:
print(dropna_series)

Series([], dtype: float64)

In [23]:
### create a series using dictionary d
mseries2 = pd.Series(data=d,index=labels)
print(mseries1)
### observe the missing values represented as "NaN"

key1     10
key2     20
key3    100
key4     40
key5     50
dtype: int64

## Treating missing values 
1) using dropna() , remove all the elements with missing values. elements here can be elements of an array, row of a file etc..

2) Impute missing values with meaningful valid value. Imputation means replacement of missing values with valid values
   - what meaningful values
     - in case of a numeric variable or column, missing values are replaced by average value of all the elements in the column
                  A
                  1
                  2
                  3
                  Nan            imputation value = mean(A) 
                  5
                  
     - in case of a numeric variable or column, missing values are replaced by median value of all the elements in the column
                  A
                  1
                  2
                  3
                  Nan            imputation value = median(A) 
                  5
                  
     - - in case of a numeric variable or column, missing values are replaced by mode value of all the elements in the column
                  A
                  1
                  2
                  3
                  Nan            imputation value = mode(A) 
                  5    
                  
     - in case of a categorical variable or column, missing values are replaced by mode - frequent occuring value in the column
                  A
                  cat1
                  cat1
                  cat1
                  Nan            imputation value = cat1
                  cat5

In [47]:
mseries = pd.Series(data=d,index=labels)
print(mseries)

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

In [48]:
mseries

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

In [49]:
# mseries.dropna(inplace=True)
mseries.dropna()

Series([], dtype: float64)

In [45]:
mseries

Series([], dtype: float64)

In [46]:
## fill NaN numbers with zeroes or any default value 
### this is called data imputation
mseries.fillna(10,inplace=True)

Series([], dtype: float64)

In [39]:
mseries

a    10.0
b    10.0
c    10.0
d    10.0
e    10.0
dtype: float64

MISSING VALUES WITH DATA FRAMES

In [50]:
### create a dictionary
#### we will pass  a list of values for each key
#### np.nan signifies missing value that is being induced

d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [51]:
print(d)

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [52]:
df = pd.DataFrame(d)

In [35]:
df

#### row 0 has no missing values
### row 1 and 2 has missing values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [54]:
#### pandas will drop any row or column with missing values.
#### df.dropna() drops rows with NaN values in it. because defauly axis parameter =0 represents rows.
df.dropna(axis=0,inplace=False)

#### npte this has dropped rows 1 and 2 entirely

     A    B  C
0  1.0  5.0  1

In [58]:
df

### since inplace=False all the NaN value have been reinstated

df.dropna(axis=0,inplace=True)

In [64]:
df  
### rows with NaN have beeen removed permanently

     A    B  C
0  1.0  5.0  1

Removing Missing values in columns

In [63]:
dict1 = {'cola':[1,2,np.nan],'colb':[5,np.nan,np.nan],'colc':[1,2,3]}

In [66]:
dfneew = pd.DataFrame(dict1)

In [67]:
#### to drop missing values in missing value, we specify axis=1
dict2 = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df_dict = pd.DataFrame(dict2)

In [68]:
df_dict

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [69]:
df_dict.dropna(axis=1)

### has dropped columns A and B which had null or NaN values

   C
0  1
1  2
2  3

In [70]:
df_dict     ### hard delete does not happen because inplace=False

## so change the code as below to remove the columns with NA values permanently

### df_dict.dropna(axis=1,inplace=True)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [72]:
#### using Threshold. Set the threshold of Non NaN values for getting dropped
d3 = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df3 = pd.DataFrame(d3)
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [73]:
#### row 1 has 3 Non NaN values (no missing values)
#### row 2 has 2 Non NaN values 
### row 3 has 1 Non NaN value 
#### we can set the threshold to retain Row1 and drop only row 2

df3.dropna(axis=0,thresh=2)

### observe second row is retained becausee it had 2 NON NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [76]:
df3  
### since inplace=False, the values are not deleted premanently

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

###### Imputing Missing Values

In [ ]:

##### replace missing values using value parameter

In [78]:
### one way to fill missing values is by finding the mean of that column and replacing missing valuees
### with that mean.
### note below that df['A'].mean() helps in getting the mean of column A
df3['A'].fillna(value=df3['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [79]:
df3['A'].fillna(value=df3['B'].mean())

0    1.0
1    2.0
2    5.0
Name: A, dtype: float64

In [17]:
#### note that inspite of all dropping of missing values using dropna and filling missing values using
#### fillna, when we print df3, we still see old values.
df3

#### this is because, we did not use the parameter inplace while dropping or filling.
#### inplace = True will make the drops and fill ins permanent.
#### its a good practice to first try out our missing value replacement process with inplace=False.
#### Verify the contents and then finally make the changes permanent with Inplace= True

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3